ping-developers-header = المطورين

cfg-no-params-error = تم تحديد عنصر تعيين غير صالح. الرجاء تشغيل هذا الأمر بدون أية عناصر لعرض تعليمات التعيين.

cfg-mode-invalid-error = الرجاء تحديد وضع صحيح. (إما `review` أو `autoapprove`)

cfg-feed-reactions-already-disabled = التصويت على الاقتراحات معطل بالفعل

cfg-mode-review = جميع الاقتراحات تنتظر من أجل الفحص

suggestion-review-embed-title = اقتراح بإنتظار الفحص (#{{id}})

disabled = معطل

cfg-already-staff-role-error = هذه الرتبة تم بالفعل إضافتها كرتبة عامل!

cfg-log-reset-success = تم إعادة تعيين قناة السجلات بنجاح.

cfg-reset-approved-role-success = تم إعادة تعيين رتبة الاقتراحات الموافق عليها بنجاح.

cfg-suggestion-channel-title = **قناة الاقتراحات الموافق عليها:**

cfg-not-staff-role-error = هذه الرتبة ليست رتبة عامل حالياً.

verify-ack-global-admin = مشرف عالمي

invalid-user-error = يجب عليك أن تختار مستخدم صحيح!

cfg-clean-commands-enabled = التنظيف الذاتي لأوامر الاقتراحات **مُمَكن**.

suggestion-footer = هوية الاقتراح: {{id}} | قُدم في

support-invite = تحتاج مساعدة مع البوت؟ انضم إلى السيرفر المساعد خلال {{link}} 😉

cfg-denied-channel-title = **قناة الاقتراحات المرفوضة:**

other-configuration-title = تعيينات أخرى

help-alias = اسم أخر

command-disabled = هذا الأمر حالياً معطل عالمياً.

cfg-already-approved-role-error = هذه الرتبة معدة بالفعل لكي تُعطى عندما اقتراح العضو يٌتم الموافقة عليه!

role-configuration-title = تعيين الرتب

user-protected-error = هذا المستخدم محمي و لا يمكن منعه عالمياً.

verify-permission-level-footer = مستوى الترخيص: {{level}}

cfg-approved-role-success = الأعضاء الذين لديهم اقتراحات موافق عليها سوف يحصلون على الرتبة {{role}}.

verify-ack-global-blacklist = ممنوع عالمياً

cfg-admin-role-remove-success = أزلت {{role}} من قائمة رتب المشرفين على السيرفر.

user-flags-list = معرفات {{user}}: `{{flags}}`

cfg-allowed-roles-title = **الرتب المسموح لها بالاقتراح:**

changelog-embed-header = سجل التغييرات: {{version}}

verify-ack-developer = مطور

no-ack-set = لا معرفة محددة

cfg-emoji-mid-disable-success = تم بنجاح تعطيل اللا رأي

no-suggestion-error = الرجاء إعطاء اقتراح!

cfg-emoji-up-set-success = تم بنجاح وضع ايموجي التأييد من أجل هذا السيرفر إلى {{emote}}.

cfg-no-emoji-error = يجب عليك أن تختار ايموجي.

cfg-status-title = حالة التعيين

ack-reset-success = تم إعادة ضبط المعرفة الخاصة ب{{user}}.

suggestion-header = اقتراح

help-base-description = الرجاء الذهاب إلى https://suggester.js.org/ من أجل رؤية قائمة الأوامر و معلومات الاستعمال!

add-remove-invalid-action-error = يجب عليك أن تحدد `add` أو `remove`.

help-additional-info = معلومات إضافية

help-documentation = الموثوقات

log-suggestion-submitted-review-title = قد أرسل اقتراح للمراجعة {{user}}

no-status-error = يجب عليك أن تحدد حالة صحيحة!

no-avatar-error = يجب عليك أن تحدد صورة صحيحة!

remove-log-channel = أزل قناة السجل القديمة

guild-notifications-already-enabled = إشعارات السيرفر مُمكنة بالفعل.

cfg-clean-commands-disabled = التنظيف الذاتي لأوامر الاقتراحات **معطل**.

suggestion-submitted-review-success = تم إرسال اقتراحك للمراجعة!

no-attachment-error = الرجاء توفير صورة!

invalid-avatar-error = الرجاء توفير عنوان صورة صحيح! صور يمكنهم أن يكون لديهم امتدادات `jpeg`, `jpg`, `png`, أو `gif`

setup-prefix-input = أي كتابة بدون مسافات

cfg-allowed-roles-append = (جميع المستخدمين يمكنهم إرسال اقتراحات)

cfg-feed-reactions-already-enabled = التصويت على الاقتراحات مُمكن بالفعل

deleted-dm-title = تم إزالة اقتراحك في **{{server}}**!

cfg-clean-commands-no-manage-messages = التنظيف التلقائي للأوامر الاقتراحات يَلزم البوت إذن **إدارة الرسائل** في السيرفر. الرجاء إعطاء البوت هذا الإذن ثم حاول مجدداً.

vote-total-header = عدد الأصوات

cfg-staff-role-add-success = أضفت **{{role}}** إلى قائمة عاملين السيرفر.

cfg-commands-channel-append = (يمكن للاقتراحات أن ترسل في جميع القنوات)

info-comment-count-header = عدد التعليقات

invalid-suggestion-id-error = الرجاء توفير ID اقترح صحيح.

cfg-emoji-up-disable-success = تم تعطيل صوت التأييد بنجاح.

suggestion-from-title = اقتراح من {{user}}

error = تم حصول خطأ. الرجاء المحاولة مجدداُ.

vote-count-opinion = رأي:

cfg-review-set-success = تم جعل {{channel}} قناة مراجعة الاقتراحات بنجاح.

none-configured = لا شيء تم تعيينه

setup-autoapprove-text = موافقة تلقائية

vote-count-up = التأييدات:

nan-mass-deny-error = واحد أو أكثر من ال IDs الذى أدخلتهم ليس رقماً. الرجاء التحقق أن جميع ال IDs أرقام. إذا كنت تحاول أن تحدد سببا, أزد `-r` بين IDs الاقتراحات و السبب.

setup-review-channel-desc = هذه هي القناة الذي سوف يتم إرسال الاقتراحات إليها عندما يتم إرسالهم ليراجعهم عامل.

permission--move-members = تحريك الأعضاء

approved-dm-title = تم الموافقة على اقتراحك في **{{server}}**!

permission--change-nickname = تغيير الكناية

changelog-released-footer = سجل التغييرات نشر في

cfg-feed-reactions-enabled = التصويت على الاقتراحات **مُمكن**.

cfg-block-role-remove-success = الأعضاء مع رتبة **{{role}}** ليسوا ممنوعين من استخدام البوت في هذا السيرفر.

status-set-success = تم وضع الحالة!

blacklist-no-args-error = يجب عليك أن تحدد أو `list` لكي تظهر قائمة الأعضاء الممنوعين.

verify-ack-server-staff = عمال السيرفر

cfg-emoji-invalid-setting-error = يجب عليك أن تحدد إعداد إيموجي صحيح. (up, mid, down, on, off, toggle)

deleted-by = تم إزالته بواسطة {{user}}

no-flag-specified-error = يجب أن تحدد علامة!

unknown = غير معروف

setup-admin-roles-desc = أي عضو لديه رتبة مشرف على السيرفر يمكنه أن يستخدم جميع أوامر العمال, أيضاً أن يعدل تعيينات البوت. أي شخص لديه إذن إدارة السيرفر تلقائياً يُعد كمشرف مهما كانت تعيينات السيرفر.

queue-post-link = الاقتراح

command--whitelist = تضع سيرفر في القائمة البيضاء

command--approve = موافقة على اقتراح

server-admin-permission = مشرف على السيرفر (إذن إدارة السيرفر أو رتبة مشرف)+

blacklist-success = **{{user}}** (`{{id}}`) تم منعه من استخدام البوت في هذا السيرفر.

help-prefix-info = بادئتي في هذا السيرفر هي {{prefix}}

is-globally-banned = {{banned}} ممنوع عالمياً.

info-author-header = المرسل

permission--manage-emojis = إدارة الإيموجي

user-not-blacklisted-error = هذا المستخدم ليس ممنوعاً من استخدام البوت في هذا السيرفر.

none-specified-mass-error = يجب عليك أن تحدد على الأقل اقتراح واحد.

command--suggest = ترسل اقتراح

cfg-log-set-success = تم جعل {{channel}} قناة السجلات بنجاح.

mass-deny-success-results-detailed = **مرفوض:** {{list}}

too-long-suggestion-error = لا يمكن للاقتراحات أن تكون أطول من 1024 رمز.

approve-deny-header = موافقة/رفض

selected = مختارة

status-no = لن يحدث

cfg-invalid-role-param-error = الرجاء تحديد `add`, `remove`, أو `list`.

blocklist-empty = ليس هناك أي مستخدمين ممنوعين من استخدام البوت في هذا السيرفر.

command--blacklisttemp = تظهر معلومات حول الأمر القائمة السوداء المهمل

setup-denied-channel-desc = هذه هى القناة التى سيرسل فيها جميع الاقتراحات المرفوضة و المزالة.

status-mark-log = #{{id}} غير الحالة ل {{user}}

user-not-blocked-error = هذا المستخدم ليس ممنوعاً من استخدام البوت في هذا السيرفر.

no-attachment-remove-error = هذا الاقتراح  ليس لديه أي صور.

cfg-denied-set-success = تم  جعل {{channel}} قناة الاقتراحات المرفوضة.

setup-log-channel-desc = هذه هي القناة التي يسجل فيها كل الأوامرعلى الاقتراحات.

cfg-self-vote-enabled = الأعضاء يمكنهم أن يُصَوتوا لاقتلراحتهم.

command-cooldown = 🕑 هذا الأمر في فترة تهدئة لمدة {{time}} ثوان اخرى.

is-not-globally-banned = {{banned}} ليس ممنوع عالمياً.

tutorial-get-started-header = هيا فلنبدأ!

locale-server-setting-prompt = إذا كنت تريد أن تجعل هذة اللغة, اللغة الإفتراضية لالسيرفر, استخدم `{{prefix}}config locale {{code}}`.

cfg-mode-title = **الوضع:**

setup-review-text = مراجعة

denied-by = تم رفضه بواسطة {{user}}

missing-elements-header = العناصر الناقصة

suggestion-denied-title = اقتراح مرفوض

cfg-self-vote-already-disabled = الأعضاء بالفعل لا يمكنهم التصويت لأجل اقتراحتهم.

guild-notifications-already-disabled = إشعارات السيرفر مُبطَلَة بالفعل.

status-progress = يتم تنفيذه

command-desc--help = تُظهر معلومات الأمر

db-no-result-found = لم يتم العثور على نتائج

setup-complete-desc = البوت سيعمل الآن في السيرفر, جربه باستخدام `{{prefix}}suggest`!

already-blocked-error = هذا المستخدم بالفعل ممنوع من استخدام البوت في هذا السيرفر!

protip-support = إذا كنت تريد مساعدة مع البوت أو كنت تريد أن تقترح ميزات جديدة, أنضم إلى [السيرفر المساعد]({{support_invite}})

cfg-allowed-role-add-success = يمكن للأعضاء الذين لهم دور {{role}} من الأن فصاعدا إرسال اقتراحات.

config-name--commands = صفحة أمر الاقتراح

everyone-permission-warning = ستؤدي إضافة دور "@/everyone" إلى التكوين إلى منح __جميع أعضاء الخادم الخاص بك _ أذونات محسنة على الروبوت. تفاعل مع {{check}} إذا كنت ترغب في إضافة دور الجميع ، و {{x}} إذا كنت ترغب في الإلغاء

cfg-already-admin-role-error = تمت إضافة هذا الدور بالفعل باعتباره دور المسؤول

suggestion = اقتراح

cfg-no-manage-roles-error = يُرجى منح {{bot}} إذن **Manage Roles** لكي يعمل دور الاقتراح المعتمد.

cfg-one-vote-already-enabled = يقتصر الأعضاء بالفعل على اختيار خيار رد فعل واحد عند التصويت على اقتراح.

cfg-internal-title = التكوين الداخلي

protip-title = **نصيحة محترف:**

log-suggestion-submitted-footer = معرّف الاقتراح: {{id}} | معرّف المستخدم: {{user}}

module-desc--suggestions = أوامر لتقديم الاقتراحات والتفاعل معها

nan-mass-approve-error = واحد أو أكثر من معرّفات الاقتراح التي أدخلتها ليس رقمًا. يرجى التأكد من أن جميع المعرفات الخاصة بك هي أرقام. إذا كنت تحاول تحديد تعليق ، أضف ``"r-"`` بين معرّفات الاقتراح والتعليق.

block-reason-header = السبب:

mode-autoapprove-disabled-error = يتم تعطيل هذا الأمر عند تعيين الوضع على الموافقة التلقائية.

comment-already-deleted-error = لقد تم حذف هذا التعليق بالفعل!

block-user-bot-error = هذا المستخدم روبوت ، وبالتالي لا يمكن حظره

config-name--colorchange = تغيير اللون

specify-user-or-guild-error = يجب تحديد "المستخدم" أو "سيرفر

config-name--mode = الوضع

mark-timeout-error = انتهت مهلة اختيار رد الفعل. يرجى إعادة تشغيل هذا الأمر إذا كنت ترغب في المتابعة

block-log-title = {{staff}} حظر {{user}}

suggestion-votes = أصوات:

config-desc--admin = الرتب المسموح لها بتعديل إعدادات البوت, و أيضاً يمكنهم إستخدام جميع أوامر العمال, (الأعضاء مع إذن **Manage Server** لديهم الإذن بإستخدام هذه الأوامر)

autosetup-category = الإقتراحات

attachment-added-header = تمت إضافة المرفق

config-examples--admin =
  `{$p}config admin add Owner`
  يضيف رتبة "Owner" كرتبة مسئول

  `{$p}config admin add @Management`
  يضيف رتبة "Management" المذكورة كرتبة  مسؤول

  `{$p}config admin add 658753146910408724`
  يضيف رتبة بالمعرف 658753146910408724 كرتبة مسؤول

  `{$p}config admin remove Owner`
  يزيل رتبة "Owner" من قائمة المسؤولين

command-desc--removeattachment = يزيل مرفق من إقتراح

suggestion-already-denied-approve-error = تم رفض هذا الإقتراح بالفعل! الإقتراحات المرفوضة لا يمكن قبولها.

unavailable = غير متوفر

cfg-emoji-disabled-error = هذا الملصق معطل بالفعل.

help-usage = الإستخدام

config-name--prefix = البادئة

command-desc--massapprove = يقبل إقتراحات متعددة في نفس الوقت

suggestion-change-review-embed = تم إجراء تغيير على هذا الإقتراح

config-name--locale = اللغة

command-usage--topvoted = top (الوقت)

config-examples--mode =
  `{$p}config mode review`
  يضبت الوضع إلى `review`

  `{$p}config mode autoapprove`
  يضبت الوضع إلى `autoapprove`

command-usage--setup = setup

trello-action-deny-label = الإقتراحات المرفوضة سوف يحصلوا على العنوان **{{label}}** في لوحة التريلو

status-already-set-error = هذا الإقتراح لديه حالة **{{status}}** بالفعل

cfg-comment-time-enabled = سوف يظهر زمن التعليقات في مرفق الإقتراح

command-server-only = هذا الأمر ليس متاحاً في الرسائل الخاصة.

create-log-channel = إنشاء قناة سجل الإقتراحات

command-desc--stats = يظهر الرابط لإحصائيات البوت

config-name--blocked = الرتب الممنوعة

cfg-not-allowed-role-error = هذه الرتبة غير مسموح لها بإرسال الإقتراحات حالياً.

status-mark-dm-title = تم تغيير حالة إقتراحك في **{{server}}**!

cfg-already-blocked-role-error = هذه الرتبة ممنوعة بالفعل من إستخدام البوت في هذا السيرفر.

exempt-no-args-error = يجب تحديد مستخدم لإستثنائه

protip-block = يمكنك منع مستخدم من إستعمال البوت في السيرفر بإستخدام `{{prefix}}block <المستخدم>`

command-usage--support = support

verify-ack-global-block = ممنوع نهائياً

command-examples--status =
  `{$p}mark 1 implemented`
  يصنف الإقتراح رقم 1 كمنفذ

  `{$p}mark 1 working This will be released soon!`
  يصنف الاقتراح رقم 1 على أنه قيد التقدم وإضافة تعليق يقول "سيتم إصدار هذا قريبًا!"

  > قائمة الحالات:
  > <:simplementednum:822458050161147914> منفذ  (implemented)
  > <:sworkingnum:822458050374795295> قيد التقدم (working)
  > <:sconsidernum:822458050111340544> في الإعتبار (considered)
  > <:sdefaultnum:822457150507974666> إفتراضي (default)
  > <:snonum:822458049801355315> لن يحصل (no)

command-usage--sinfo = shortinfo [معرف الإقتراح]

cfg-not-blocked-role-error = هذه الرتبة ليست ممنوعة حالياً.

module-desc--other = أوامر متنوعة

module-name--developer = مطور

config-name--allowed = الرتب المسموح لها بالإقتراح

command-desc--acomment = يضيف تعليقًا إلى اقتراح تمت الموافقة عليه بشكل مجهول

command-usage--changelog = سجل التغييرات

setup-mode-desc = هذا هو الوضع لإدارة الإقتراحات, إما `review` أو `autoapprove`

command-examples--down =
  `{$p}down`
  يعرض أقل 10 اقتراحات من حيث التصويت

  `{$p}down 1w`
  يُظهر أقل 10 اقتراحات تم التصويت عليها من الأسبوع الماضي

command-examples--approve =
  `{$p}approve 1`
  يوافق على الاقتراح رقم 1

  `{$p}approve 1 This is a comment`
  يوافق على الاقتراح رقم 1 ويضيف تعليقًا من الموافق يقول "This is a comment"

block-reason-too-long-error = أسباب المنع محدودة إلى 1024 حرف.

suggestion-submitted-staff-review-success = تم إرسال إقتراحك لعمال السيرفر للفحص!

comment-added-title = تمت إضافة تعليق

locale-list-incomplete-title = لغات غير مكتملة

config-name--suggestions = قناة الإقتراحات المقبولة

invalid-guild-id-error = معرف سيرفر خطأ

protips-already-disabled = تم تعطيل النصائح بالفعل.

suggestion-updated-review = تم إرسال تعديلك المقترح للفحص!

mass-approve-fail-results-detailed = **لم يتَمكْن من الموافقة على:** {{list}}

config-desc--allowed = الرتب التي تسطيع أن تقترح. لو لم يكن هناك رتب معينة, جميع المستخدمين يمكنهم الإقتراح.

review-command-info =
  إستخدم **{$prefix}approve {$id}** لكي ترسل إلى {$channel}
  إستخدم **{$prefix}deny {$id}** لكي ترفض

pagination-page-count = صفحة {{current}}/{{total}}

comment-added-dm-title-follow = تم إضافة تعليق إلى الإقتراح الذي تتباعه في **{{server}}**!

exempt-already-error = هذا المستخدم بالفعل تم إستثنائه من الإيقاف المؤقت للإقتراحات

no-locale-error = لم يتم العثور على لغة يناءًا على إدخالك! استخدم الأمر مجدداً بدون مدخلات لتعرض قائمة اللغات المتاحة.

invalid-member-error = يجب تحديد مستخدم صحيح!

config-name--cap = غطاء الاقتراح
